# Практическая работа

## Постановка задачи

Дан одномерный массив `A` размерности `N`.

Необходимо найти сумму отрицательных элементов, расположенных между максимальным и минимальным элементами массива.

---

## Описание алгоритма

Для решения задачи был разработан следующий алгоритм:

1. Ввести количество элементов массива.
2. Ввести элементы массива.
3. Найти индексы максимального и минимального элементов массива 
4. Определить границы участка между минимальным и максимальным элементами.
5. Просмотреть все элементы между найденными границами.
6. Найти сумму отрицательных элементов, расположенных между минимальным и максимальным элементами.
7. Вывести результат на экран.

---

## Подробное описание выполнения задачи

Цель работы — найти сумму отрицательных элементов одномерного массива, расположенных между минимальным и максимальным элементами.

Для решения задачи был использован следующий порядок действий:

### Шаг 1. Ввод данных

Пользователь вводит количество элементов массива и сами элементы массива через пробел.

Пример:

```text
Введите количество элементов массива: 8
Введите элементы массива: 3 -2 7 -5 -1 4 -3 1
```

---

### Шаг 2. Поиск максимального и минимального элементов

Сначала предполагается, что первый элемент массива одновременно является минимальным и максимальным.

```python
max_index = 0
min_index = 0
```

Далее с помощью цикла выполняется просмотр всех элементов массива.

Если найден элемент больше текущего максимального, запоминается его индекс.

Если найден элемент меньше текущего минимального, также запоминается его индекс.

---

### Шаг 3. Определение границ

После нахождения индексов минимального и максимального элементов определяется их расположение в массиве.

Если максимальный элемент находится раньше минимального, то:

```python
left = max_index
right = min_index
```

Иначе:

```python
left = min_index
right = max_index
```

Таким образом определяются левая и правая границы участка массива.

---

### Шаг 4. Поиск суммы отрицательных элементов

Создаётся переменная для хранения суммы:

```python
sum_negative = 0
```

Далее перебираются все элементы между найденными границами.

Если элемент отрицательный, его значение прибавляется к общей сумме.

---

### Шаг 5. Вывод результата

После завершения вычислений программа выводит найденную сумму отрицательных элементов.

---

## Исходный код программы

```python
# Вводим количество элементов массива
N = int(input("Введите количество элементов массива: "))

# Вводим элементы массива
A = list(map(int, input("Введите элементы массива: ").split()))

# Считаем первый элемент одновременно максимальным и минимальным
max_index = 0
min_index = 0

# Поиск индексов максимального и минимального элементов
for i in range(1, N):

    if A[i] > A[max_index]:
        max_index = i

    if A[i] < A[min_index]:
        min_index = i

# Определяем границы между минимальным и максимальным элементами
if max_index < min_index:
    left = max_index
    right = min_index
else:
    left = min_index
    right = max_index

# Переменная для хранения суммы отрицательных элементов
sum_negative = 0

# Поиск суммы отрицательных элементов между границами
for i in range(left + 1, right):

    if A[i] < 0:
        sum_negative = sum_negative + A[i]

# Вывод результата
print("Сумма отрицательных элементов =", sum_negative)
```

---

## Пример работы программы

### Входные данные

```text
Введите количество элементов массива: 10
Введите элементы массива: 5 -2 8 -1 -7 3 -4 10 -6 2
```

### Анализ

Массив:

```text
[5, -2, 8, -1, -7, 3, -4, 10, -6, 2]
```

Минимальный элемент:

```text
-7
```

Максимальный элемент:

```text
10
```

Элементы между ними:

```text
3 -4
```

Отрицательные элементы:

```text
-4
```

### Результат

```text
Сумма отрицательных элементов = -4
```

---

## Вывод

В ходе выполнения работы был разработан алгоритм поиска суммы отрицательных элементов, расположенных между минимальным и максимальным элементами массива.

Для решения использовал базовые конструкции языка Python: списки, циклы и условные операторы. Поиск минимального и максимального элементов реолизовал вручную, без использования встроенных функций, сделал это для понимания принципа работы и прокачки навыков работы с массивами и алгоритмами обработки данных. Для более простой работы можно использовать функции: max(), min() и index()
